#Практическое задание по уроку "Строки и индексация строк"

# Выведите на экран(в консоль) первый символ этой строки.
# Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
# Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
# Выведите на экран(в консоль) это слово наоборот.
# Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')

example="Топинамбур"

print(example[0])                             #первый символ этой строки
print(example[-1])                            #последний символ этой строки (используя отрицательный индекс).
print(example[int(len(example)/2)::])         #вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(example[::-1])                          #это слово наоборот
print(example[1::2])                          #каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')