#Практическая работа по уроку "Организация программ и методы строк".

# Цель: Написать программу на языке Python с использованием Pycharm для работы с методами строк и организации программ.
#
# 1. В проекте, где вы решаете домашние задания, создайте модуль 'module_1_4.py' и напишите весь код в нём.
#
# 2. Организуйте программу:
# Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
# Вывести количество символов введённого текста
# 3. Работа с методами строк:
# Используя методы строк, выполните следующие действия:
# Выведите строку my_string в верхнем регистре.
# Выведите строку my_string в нижнем регистре.
# Измените строку my_string, удалив все пробелы.
# Выведите первый символ строки my_string.
# Выведите последний символ строки my_string.
# Примечания:
# Для вывода значений на экран используйте функцию print().
# Для вызова методов строк используйте операцию точки '.'.
# Дополнительно о всех методах строк можно узнать здесь.

my_string = input("Что то, не знаю что, но введи: ", )  # Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
len(my_string)                                          # Вывести количество символов введённого текста
print(my_string .upper())                               # Выведите строку my_string в верхнем регистре.
print(my_string .lower())                               # Выведите строку my_string в нижнем регистре
print(my_string .replace(" ", ""))          # Измените строку my_string, удалив все пробелы.
print(my_string[:1:])                                   # Выведите первый символ строки my_string.
print(my_string[-1::])                                  # Выведите последний символ строки my_string.

