#Практическое задание по теме "Переменные".

# Задача:
# Напишите 4 переменных которые буду обозначать следующие данные:
# Количество выполненных ДЗ (запишите значение 12)
# Количество затраченных часов (запишите значение 1.5)
# Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# Выведите на экран(в консоль), используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

homework_count=12
wasted_hours=1.5
lesson_name="Python"
avg_time_per_lesson=(float(wasted_hours/homework_count))

# print(type(str(wasted_hours)))

(print
    (
    lesson_name,
    " Всего задач ",
    ", " ,
    "затрачено часов: " ,
    wasted_hours ,
    ", " ,
    "среднее время выполнения ",
    avg_time_per_lesson
    ))