
'''
float()
Эта встроенная функция конвертирует число или строку в число с плавающей точкой и возвращает результат. Если из-за некорректного ввода конвертация не проходит, возвращаются ValueError или TypeError.
'''

#* Пример № 1
# print(float(596))

# Вывод -> 596.0

#* Пример № 2
# print(float(26))

# Вывод -> 26.0

#* Пример № 3
# a = 256.8564525636685

# print(round(a, 2))

# Вывод -> 256.86

'''
int()
Эта функция возвращает целое число из объекта, переданного в параметра. Она может конвертировать числа с разным основанием (шестнадцатеричные, двоичные и так далее) в целые.
'''

#* Пример № 1
# print(int(5.6))

# Вывод -> 5

