name= "Serj"
print("Hello, " + name)
print(name*5)
print("Hello "*5)
#f строка -
print(f"что то, {name}") # для того, чтобы использовалась переменная в ковычках - необходимы фигурные скобки

# срез [0:1:2] 0 начало, 1 конец, 2 шаг
print(name[0:3])  # срез от 0 до 3 невключительно ## срез можно начинать с пустого множества по типу [:2:] начало среза, шаг
print(name[0:3:2])  #срез от 0 до 3 невключительно, шаг в 2, т.е. пропускается каждый 2 символ.
print(name[::-1]) # шаг символов -1, т.е. мы идем от начального символа назад