'''
Функция any() интересуется значениями True и возвращает True, находя первое из них, или False — если не нашла ни одного. А функция all() действует с точностью до наоборот. Она ищет значения False и возвращает False, когда найдёт первое такое значение, или возвращает True, если ни одного значения False не нашла.
'''

#* all()

#* Пример № 1
item_list = [True, True, True, True]
print (all(item_list))

# Вывод -> True

'''
В данном случае функция all() вернула значение True, так как все элементы в итерируемом объекте равны True. 
Любые непустые строки всегда рассматриваются как True.
'''
#* Пример № 2
item_list = ["mango", "banana", "apple", "orange"]
print (all(item_list))

# Вывод -> True

'''
Если список совершенно пуст, all() всегда будет возвращать True.
'''

#* Пример № 3
item_list = []
print (all(item_list))

# Вывод -> True

'''
Если некоторые элементы итерируемого объекта  – пустые строки, при вызове all() они считаются False:
'''

#* Пример № 4
item_list = ["mango", "banana", "apple", ""]
print (all(item_list))

# Вывод -> False

'''
И, наконец, если элемент просто равен False (булево значение), all() вернёт False:
'''

#* Пример № 5
item_list = ["mango", "banana", "apple", False]
print (all(item_list))

# Вывод -> False

#* any()

'''
Функция any() возвращает значение True, если хотя бы один элемент во всём итерируемом типе истинный.
'''

#* Пример № 1

item_list = [True, True, True, False]
print (any(item_list))

# Вывод -> True

'''
Непустые строковые значения также всегда являются истинными.
'''

item_list = ["mango", False]
print (any(item_list))

# Вывод -> True

'''
Если список полностью пуст, any() всегда будет возвращать False:
'''

#* Пример № 3

item_list = []
print (any(item_list))

# Вывод -> False

'''
Если в итерируемом объекте содержатся пустые строки, при вызове any() их значение расценивается как False.
'''

#* Пример № 4

item_list = ["", ""]
print (any(item_list))

# Вывод -> False

'''
В any() элемент со значением 0 также будет считаться False:
'''

#* Пример № 5

item_list = [0, 0]
print (any(item_list))

# Вывод -> False