'''
В Python, как и в других языках, есть логический тип переменных bool, который имеет всего два значения: True (истина) и False (ложь). Его возвращают логические операторы (например сравнение чисел или проверка присутствия элемента в списке), и именно этот тип обычно используется в if и while. Тем не менее, явно использовать bool или операторы необязательно: существуют правила, по которым значение любого типа приводится к True или False.
'''

# По-английски это называется truthy и falsy, то есть «примерно-но-не-совсем-истинные», «истинноватые» значения. Общепринятого русского перевода нет, но в этой статье под истинным или ложным значением объекта всегда подразумеваются именно эти штуки, а булевы значения везде названы True и False.

#* Пример № 1
# Вот как это работает:

a = 5

if a:
    print(a)
# Вывод -> 5

a = 0

if a:
    print(a)

# Вывод -> Ничего не выводится

'''
Любое значение в Python при необходимости может интерпретироваться как True или False в соответствии с правилами языка. Об этом написано и в документации.

Любой объект может быть протестирован на истинность и использован в условиях if и while, а также как операнд булевых операций (and, or, not).
Если объект используется таким образом, то он находится в булевом контексте. Грубо говоря, это такое место в коде, которое требует от объекта значения либо True, либо False.

В булевом контексте может использоваться как переменная, так и выражение. Если используется выражение, значит, оценивается истинность его результата.
'''

'''
Объекты, которые приравниваются к False
Любой объект, для которого определен метод __len__, возвращающий для этого объекта 0, является falsy. Документация:

По умолчанию объект считается истинным, если его класс не определяет метод __bool__, возвращающий для объекта False, или метод __len__, возвращающий для него ноль.

Последовательности и коллекции
    пустой список: [];
    пустой кортеж: ();
    пустой словарь: {};
    пустое множество: set();
    пустая строка: “”;
    пустой диапазон: range(0).

Нули любых численных типов
    целочисленный ноль: 0;
    ноль с плавающей точкой: 0.0;
    комплексный ноль: 0j.
    
Константы
    None;
    False.
    
Объекты, которые приравниваются к True
Согласно документации:

По умолчанию любой объект имеет истинное значение.
В частности, истинными являются:

    все непустые последовательности и коллекции (списки, кортежи, словари, множества, диапазоны и строки);
    все ненулевые числа;
    True.
'''

print(bool(5))
# Вывод -> True

print(bool(0))
# Вывод -> False