'''
Round — встроенная функция Python. Ее задача — округлять число с плавающей точкой до той цифры, которую задает пользователь. Если ее не задать, то возвращается ближайшее целое число, ведь значением по умолчанию является 0. Функция round помогает «улучшать» числа с плавающей точкой.
'''

'''
Синтаксис
round(float_number, number_of_decimals)
'''

# Целые числа
# a = 12
# round (a)
# print (a)

# # Десятичные числа
# b = 21.7
# c = 21.4
# print(round(b))
# print(round(c))

# # когда последняя цифра 5
# a = 5.465
# print(round(a, 2))

# когда последняя цифра >=5
# b = 5.476
# print(round(b, 2))

# когда последняя цифра меньше 5
# c = 5.473
# print(round(c, 2))

