'''
set()
Функция set() используется для создания наборов данных, которые передаются 
в качестве параметра. Обычно это последовательность, например строка или 
список, которая затем преобразуется в множество уникальных значений.
Встроенный тип множество (set) в Python используется для хранения нескольких 
элементов в одном объекте. Этот тип объектов не допускает дублирования или 
изменения элементов, только добавление новых или удаление существующих.
'''

#* Пример № 1
# tmp_set = {1, 2, 3, 4, 5}

# print(tmp_set)
# print(type(tmp_set))

# print(set("Hello"))

# # Вывод -> {'e', 'H', 'l', 'o'}

#* Пример № 2
# print(set((1, 2, 3, 4, 4, 5, 3)))

# Вывод -> {1, 2, 3, 4, 5}

txt = 'Жизнь не обязана давать нам то, чего мы ждём. Надо брать то, что она даёт, и быть благодарным уже за то, что это так, а не хуже.'

print(set(txt))
