'''
Переменная — это простейшая именованная структура данных, в которой может быть сохранён промежуточный или конечный результат работы программы. Переменная — это область памяти компьютера, у которой есть имя. Структурно она состоит из трёх частей:

Имя, или идентификатор, — это название, придуманное программистом, чтобы обращаться к переменной. 

Значение — это информация, которая хранится в памяти компьютера и с которой работает программа. Оно всегда принадлежит к какому-либо типу данных.

Адрес — это номер ячейки памяти, в которой хранится значение переменной.
'''

# print(126)

user_var = 126

print(id(user_var))
print(id(126))

