#Практическая работа по уроку "Динамическая типизация"

# Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
#
# В проекте, где вы решаете домашние задания, создайте модуль 'module_1_3.py' и напишите весь код в нём.
#
# 2. Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#   - Выведите значение переменной age на экран.
#   - Перезапишите в age текущее значение переменной age + новое.
# Как неверно (просто перезапись на новое число):
# a = 15
# a = 17
#   - Выведите измененное значение переменной age на экран.
#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#   - Выведите значение переменной is_student на экран.
# Примечания:
# - Для вывода значений на экран используйте функцию print().
# - Обратите внимание на использование разных типов данных и возможности их изменения.

name = "Sergey"           #Создайте переменную name и присвойте ей значение вашего имени (строка).
age = 29                  #Создайте переменную age и присвойте ей значение вашего возраста (целое число).
id_student = True   #Создайте переменную is_student и присвойте ей значение True (логическое значение).
age += 12                 #Перезапишите в age текущее значение переменной age + новое.
print(name)               #Выведите значение переменной name на экран
print(age)                #Выведите значение переменной age на экран.
print(id_student)         #Выведите значение переменной is_student на экран.