'''
max()
Эта функция используется для нахождения «максимального» значения в последовательности, итерируемом объекте и так далее. В параметрах можно менять способ вычисления максимального значения.
'''

#* Пример № 1
# print(max('a', 'A'))

# print(ord('A'))

# Вывод -> a

#* Пример № 2
# x = [5, 7, 8, 2, 5]

# print(max(x))

# Вывод -> 8

#* Пример № 3
# x = ['Яблоко', 'Апельсин', 'Автомобиль']

# print(max(x))

# Вывод -> Яблоко


'''
min()
Эта функция используется для нахождения «минимального» значения в последовательности, итерируемом объекте и так далее. В параметрах можно менять способ вычисления минимального значения.
'''

#* Пример № 1
print(min('a', 'A'))

# Вывод -> A

#* Пример № 2
# x = [5, 7, 8, 2, 5]

# print(min(x))

# Вывод -> 2

#* Пример № 3
# x = ['Виноград', 'Манго', 'Фрукты', 'Клубника']

# print(min(x))

# Вывод -> Виноград