'''
str()
Используется для создания строковых представлений объектов, но не меняет сам объект, а возвращает новый. У нее есть встроенные механизмы кодировки и обработки ошибок, которые помогают при конвертации.
'''

# name = 'Василий'
# print(name[2])

# name[2] = 'л'

# print(id(name))

# name = 'Иван'

# print(id(name))

#* Пример № 1
# print(str(5))

# print(type(str(5)))

# Вывод -> 5
# Вывод -> <class 'str'>

#* Пример № 2
# x = [5, 6, 7]

# print(str(x))
# print(type(str(x)))

# Вывод -> '[5, 6, 7]'

#* Пример № 3
# user_string = 'Hello'

# print(user_string[-1]) 

# # Вывод -> o

#* Пример № 4
# print(user_string[2])

# # Вывод -> l

#* Пример № 5
# print(user_string[0:2])

# Вывод -> He

